[NoCoverage] StringLiteral
src/modules/documents/documents.routes.ts:35:73
-         throw new ValidationError(queryResult.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(queryResult.error.issues[0]?.message ?? "")

[NoCoverage] StringLiteral
src/modules/documents/documents.routes.ts:46:68
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0]?.message ?? "")

[NoCoverage] StringLiteral
src/modules/documents/documents.routes.ts:65:68
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0]?.message ?? "")

[NoCoverage] StringLiteral
src/modules/documents/documents.routes.ts:77:68
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0]?.message ?? "")

[NoCoverage] StringLiteral
src/modules/documents/documents.routes.ts:114:49
-           parseResult.error.issues[0]?.message ?? 'Validation failed',
+           parseResult.error.issues[0]?.message ?? "",

[Survived] LogicalOperator
src/modules/documents/documents.routes.ts:35:33
-         throw new ValidationError(queryResult.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(queryResult.error.issues[0]?.message && 'Validation failed')
Tests ran:
    Documents Routes GET /documents returns 422 for invalid status query param

[Survived] OptionalChaining
src/modules/documents/documents.routes.ts:35:33
-         throw new ValidationError(queryResult.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(queryResult.error.issues[0].message ?? 'Validation failed')
Tests ran:
    Documents Routes GET /documents returns 422 for invalid status query param

[Survived] LogicalOperator
src/modules/documents/documents.routes.ts:46:33
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0]?.message && 'Validation failed')
Tests ran:
    Documents Routes POST /documents returns 422 when title is missing
    Documents Routes POST /documents returns 422 when clientEmail is invalid
    Documents Routes POST /documents returns 422 when totalValue is not positive
  and 1 more test!

[Survived] OptionalChaining
src/modules/documents/documents.routes.ts:46:33
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0].message ?? 'Validation failed')
Tests ran:
    Documents Routes POST /documents returns 422 when title is missing
    Documents Routes POST /documents returns 422 when clientEmail is invalid
    Documents Routes POST /documents returns 422 when totalValue is not positive
  and 1 more test!

[Survived] LogicalOperator
src/modules/documents/documents.routes.ts:65:33
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0]?.message && 'Validation failed')
Tests ran:
    Documents Routes PATCH /documents/:id returns 422 when body is empty
    Documents Routes PATCH /documents/:id returns 422 when totalValue is zero

[Survived] OptionalChaining
src/modules/documents/documents.routes.ts:65:33
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0].message ?? 'Validation failed')
Tests ran:
    Documents Routes PATCH /documents/:id returns 422 when body is empty
    Documents Routes PATCH /documents/:id returns 422 when totalValue is zero

[Survived] LogicalOperator
src/modules/documents/documents.routes.ts:77:33
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0]?.message && 'Validation failed')
Tests ran:
    Documents Routes PATCH /documents/:id/status returns 422 for an invalid status value

[Survived] Regex
src/modules/documents/documents.routes.ts:97:45
-       const safeName = document.title.replace(/[^a-zA-Z0-9]/g, '_')
+       const safeName = document.title.replace(/[a-zA-Z0-9]/g, '_')
Tests ran:
    Documents PDF Route GET /documents/:id/pdf returns 200 with application/pdf content type
    Documents PDF Route GET /documents/:id/pdf returns Content-Disposition attachment header with sanitized filename
    Documents PDF Route GET /documents/:id/pdf returns the PDF bytes in the response body

[Survived] OptionalChaining
src/modules/documents/documents.routes.ts:77:33
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0].message ?? 'Validation failed')
Tests ran:
    Documents Routes PATCH /documents/:id/status returns 422 for an invalid status value

[Survived] StringLiteral
src/modules/documents/documents.routes.ts:97:62
-       const safeName = document.title.replace(/[^a-zA-Z0-9]/g, '_')
+       const safeName = document.title.replace(/[^a-zA-Z0-9]/g, "")
Tests ran:
    Documents PDF Route GET /documents/:id/pdf returns 200 with application/pdf content type
    Documents PDF Route GET /documents/:id/pdf returns Content-Disposition attachment header with sanitized filename
    Documents PDF Route GET /documents/:id/pdf returns the PDF bytes in the response body

[Survived] LogicalOperator
src/modules/documents/documents.routes.ts:114:9
-           parseResult.error.issues[0]?.message ?? 'Validation failed',
+           parseResult.error.issues[0]?.message && 'Validation failed',
Tests ran:
    Documents Send Email Route POST /documents/:id/send returns 422 when recipientEmail is present but invalid

[Survived] OptionalChaining
src/modules/documents/documents.routes.ts:114:9
-           parseResult.error.issues[0]?.message ?? 'Validation failed',
+           parseResult.error.issues[0].message ?? 'Validation failed',
Tests ran:
    Documents Send Email Route POST /documents/:id/send returns 422 when recipientEmail is present but invalid

[Survived] ObjectLiteral
src/modules/documents/documents.routes.ts:122:49
-       const sender = await prisma.user.findUnique({
-         where: { id: request.user.sub },
-         select: { name: true },
-       })
+       const sender = await prisma.user.findUnique({})
Tests ran:
    Documents Send Email Route POST /documents/:id/send returns 200 with success message when email is sent
    Documents Send Email Route POST /documents/:id/send returns 200 and sends to document clientEmail by default
    Documents Send Email Route POST /documents/:id/send returns 200 and sends to override email when provided

[Survived] ObjectLiteral
src/modules/documents/documents.routes.ts:123:14
-         where: { id: request.user.sub },
+         where: {},
Tests ran:
    Documents Send Email Route POST /documents/:id/send returns 200 with success message when email is sent
    Documents Send Email Route POST /documents/:id/send returns 200 and sends to document clientEmail by default
    Documents Send Email Route POST /documents/:id/send returns 200 and sends to override email when provided

[Survived] ObjectLiteral
src/modules/documents/documents.routes.ts:124:15
-         select: { name: true },
+         select: {},
Tests ran:
    Documents Send Email Route POST /documents/:id/send returns 200 with success message when email is sent
    Documents Send Email Route POST /documents/:id/send returns 200 and sends to document clientEmail by default
    Documents Send Email Route POST /documents/:id/send returns 200 and sends to override email when provided

[Survived] BooleanLiteral
src/modules/documents/documents.routes.ts:124:23
-         select: { name: true },
+         select: { name: false },
Tests ran:
    Documents Send Email Route POST /documents/:id/send returns 200 with success message when email is sent
    Documents Send Email Route POST /documents/:id/send returns 200 and sends to document clientEmail by default
    Documents Send Email Route POST /documents/:id/send returns 200 and sends to override email when provided

[Survived] LogicalOperator
src/modules/documents/documents.routes.ts:126:24
-       const senderName = sender?.name ?? request.user.email
+       const senderName = sender?.name && request.user.email
Tests ran:
    Documents Send Email Route POST /documents/:id/send returns 200 with success message when email is sent
    Documents Send Email Route POST /documents/:id/send returns 200 and sends to document clientEmail by default
    Documents Send Email Route POST /documents/:id/send returns 200 and sends to override email when provided

[Survived] OptionalChaining
src/modules/documents/documents.routes.ts:126:24
-       const senderName = sender?.name ?? request.user.email
+       const senderName = sender.name ?? request.user.email
Tests ran:
    Documents Send Email Route POST /documents/:id/send returns 200 with success message when email is sent
    Documents Send Email Route POST /documents/:id/send returns 200 and sends to document clientEmail by default
    Documents Send Email Route POST /documents/:id/send returns 200 and sends to override email when provided

[Survived] StringLiteral
src/modules/documents/documents.routes.ts:137:46
-       return reply.status(200).send({ message: `Document sent to ${to}` })
+       return reply.status(200).send({ message: `` })
Tests ran:
    Documents Send Email Route POST /documents/:id/send returns 200 with success message when email is sent
    Documents Send Email Route POST /documents/:id/send returns 200 and sends to document clientEmail by default
    Documents Send Email Route POST /documents/:id/send returns 200 and sends to override email when provided

[NoCoverage] ObjectLiteral
src/modules/documents/documents.service.ts:104:37
-       ...(totalValue !== undefined && { totalValue: totalValue.toString() }),
+       ...(totalValue !== undefined && {}),

[Survived] ObjectLiteral
src/modules/documents/documents.service.ts:23:56
-     const doc = await prisma.document.findFirst({ where: { id: documentId, userId } })
+     const doc = await prisma.document.findFirst({ where: {} })
Tests ran:
    Documents Routes PATCH /documents/:id returns 200 with the updated document
    Documents Routes PATCH /documents/:id returns 404 when document does not exist
    Documents Routes PATCH /documents/:id/status returns 200 with the updated status
  and 17 more tests!

[Survived] ObjectLiteral
src/modules/documents/documents.service.ts:23:47
-     const doc = await prisma.document.findFirst({ where: { id: documentId, userId } })
+     const doc = await prisma.document.findFirst({})
Tests ran:
    Documents Routes PATCH /documents/:id returns 200 with the updated document
    Documents Routes PATCH /documents/:id returns 404 when document does not exist
    Documents Routes PATCH /documents/:id/status returns 200 with the updated status
  and 17 more tests!

[Survived] StringLiteral
src/modules/documents/documents.service.ts:24:37
-     if (!doc) throw new NotFoundError('Document')
+     if (!doc) throw new NotFoundError("")
Tests ran:
    Documents Routes PATCH /documents/:id returns 404 when document does not exist
    Documents Routes DELETE /documents/:id returns 404 when document does not exist
    updateDocument throws NotFoundError when document not owned by user
  and 2 more tests!

[Survived] ConditionalExpression
src/modules/documents/documents.service.ts:35:26
-       where: { userId, ...(status !== undefined && { status }) },
+       where: { userId, ...(true && { status }) },
Tests ran:
    Documents Routes GET /documents returns 200 with an array of documents
    Documents Routes GET /documents returns 200 filtered by status query param
    listDocuments returns all documents for the user in descending order
  and 2 more tests!

[Survived] StringLiteral
src/modules/documents/documents.service.ts:71:36
-           currency: data.currency ?? 'BRL',
+           currency: data.currency ?? "",
Tests ran:
    createDocument creates a document and initial version 1 in a transaction
    createDocument sets userId from parameter, not from dto

[Survived] StringLiteral
src/modules/documents/documents.service.ts:98:31
-       throw new ValidationError('Only DRAFT documents can be edited')
+       throw new ValidationError("")
Tests ran:
    updateDocument throws ValidationError when document is not DRAFT

[Survived] LogicalOperator
src/modules/documents/documents.service.ts:68:25
-           clientDocument: data.clientDocument ?? null,
+           clientDocument: data.clientDocument && null,
Tests ran:
    Documents Routes POST /documents returns 201 with the created document
    createDocument creates a document and initial version 1 in a transaction
    createDocument sets userId from parameter, not from dto

[Survived] LogicalOperator
src/modules/documents/documents.service.ts:64:21
-           templateId: data.templateId ?? null,
+           templateId: data.templateId && null,
Tests ran:
    Documents Routes POST /documents returns 201 with the created document
    createDocument creates a document and initial version 1 in a transaction
    createDocument sets userId from parameter, not from dto

[Survived] LogicalOperator
src/modules/documents/documents.service.ts:71:19
-           currency: data.currency ?? 'BRL',
+           currency: data.currency && 'BRL',
Tests ran:
    Documents Routes POST /documents returns 201 with the created document
    createDocument creates a document and initial version 1 in a transaction
    createDocument sets userId from parameter, not from dto

[Survived] LogicalOperator
src/modules/documents/documents.service.ts:72:21
-           validUntil: data.validUntil ?? null,
+           validUntil: data.validUntil && null,
Tests ran:
    Documents Routes POST /documents returns 201 with the created document
    createDocument creates a document and initial version 1 in a transaction
    createDocument sets userId from parameter, not from dto

[Survived] ObjectLiteral
src/modules/documents/documents.service.ts:102:22
-     const baseUpdate = {
-       ...rest,
-       ...(totalValue !== undefined && { totalValue: totalValue.toString() }),
-     }
+     const baseUpdate = {}
Tests ran:
    Documents Routes PATCH /documents/:id returns 200 with the updated document
    updateDocument updates document metadata without creating a new version
    updateDocument creates a new version when content is updated

[Survived] ConditionalExpression
src/modules/documents/documents.service.ts:104:9
-       ...(totalValue !== undefined && { totalValue: totalValue.toString() }),
+       ...(true),
Tests ran:
    Documents Routes PATCH /documents/:id returns 200 with the updated document
    updateDocument updates document metadata without creating a new version
    updateDocument creates a new version when content is updated

[Survived] ConditionalExpression
src/modules/documents/documents.service.ts:104:9
-       ...(totalValue !== undefined && { totalValue: totalValue.toString() }),
+       ...(false),
Tests ran:
    Documents Routes PATCH /documents/:id returns 200 with the updated document
    updateDocument updates document metadata without creating a new version
    updateDocument creates a new version when content is updated

[Survived] ObjectLiteral
src/modules/documents/documents.service.ts:108:56
-       const agg = await prisma.documentVersion.aggregate({
-         _max: { version: true },
-         where: { documentId },
-       })
+       const agg = await prisma.documentVersion.aggregate({})
Tests ran:
    updateDocument creates a new version when content is updated

[Survived] ObjectLiteral
src/modules/documents/documents.service.ts:109:13
-         _max: { version: true },
+         _max: {},
Tests ran:
    updateDocument creates a new version when content is updated

[Survived] BooleanLiteral
src/modules/documents/documents.service.ts:109:24
-         _max: { version: true },
+         _max: { version: false },
Tests ran:
    updateDocument creates a new version when content is updated

[Survived] ObjectLiteral
src/modules/documents/documents.service.ts:110:14
-         where: { documentId },
+         where: {},
Tests ran:
    updateDocument creates a new version when content is updated

[Survived] StringLiteral
src/modules/documents/documents.service.ts:50:37
-     if (!doc) throw new NotFoundError('Document')
+     if (!doc) throw new NotFoundError("")
Tests ran:
    Documents Routes GET /documents/:id returns 404 when document does not exist
    getDocument throws NotFoundError when document does not exist
    getDocument throws NotFoundError when document belongs to another user
  and 2 more tests!

[Survived] ObjectLiteral
src/modules/documents/documents.service.ts:122:33
-         return tx.document.update({
-           where: { id: documentId },
-           data: { ...baseUpdate, content: content as Prisma.InputJsonValue },
-         })
+         return tx.document.update({})
Tests ran:
    updateDocument creates a new version when content is updated

[Survived] ObjectLiteral
src/modules/documents/documents.service.ts:123:16
-           where: { id: documentId },
+           where: {},
Tests ran:
    updateDocument creates a new version when content is updated

[Survived] ObjectLiteral
src/modules/documents/documents.service.ts:124:15
-           data: { ...baseUpdate, content: content as Prisma.InputJsonValue },
+           data: {},
Tests ran:
    updateDocument creates a new version when content is updated

[Survived] ArrayDeclaration
src/modules/documents/documents.service.ts:144:70
-     const allowed = VALID_TRANSITIONS[doc.status as DocumentStatus] ?? []
+     const allowed = VALID_TRANSITIONS[doc.status as DocumentStatus] ?? ["Stryker was here"]
Tests ran:
    changeDocumentStatus throws ValidationError for invalid transition ACCEPTED → DRAFT

[Survived] ObjectLiteral
src/modules/documents/documents.service.ts:130:12
-       where: { id: documentId },
+       where: {},
Tests ran:
    Documents Routes PATCH /documents/:id returns 200 with the updated document
    updateDocument updates document metadata without creating a new version

[Survived] ObjectLiteral
src/modules/documents/documents.service.ts:129:33
-     return prisma.document.update({
-       where: { id: documentId },
-       data: baseUpdate,
-     })
+     return prisma.document.update({})
Tests ran:
    Documents Routes PATCH /documents/:id returns 200 with the updated document
    updateDocument updates document metadata without creating a new version

[Survived] ObjectLiteral
src/modules/documents/documents.service.ts:152:12
-       where: { id: documentId },
+       where: {},
Tests ran:
    Documents Routes PATCH /documents/:id/status returns 200 with the updated status
    changeDocumentStatus transitions DRAFT to SENT
    changeDocumentStatus transitions SENT to ACCEPTED
  and 2 more tests!

[Survived] StringLiteral
src/modules/documents/documents.service.ts:147:7
-         `Cannot transition from ${doc.status} to ${newStatus}`,
+         ``,
Tests ran:
    Documents Routes PATCH /documents/:id/status returns 422 for an invalid transition
    changeDocumentStatus throws ValidationError for invalid transition DRAFT → ACCEPTED
    changeDocumentStatus throws ValidationError for invalid transition ACCEPTED → DRAFT

[Survived] StringLiteral
src/modules/documents/documents.service.ts:163:31
-       throw new ValidationError('Only DRAFT documents can be deleted')
+       throw new ValidationError("")
Tests ran:
    deleteDocument throws ValidationError when document is not DRAFT

[Survived] ObjectLiteral
src/modules/documents/documents.service.ts:151:33
-     return prisma.document.update({
-       where: { id: documentId },
-       data: { status: newStatus },
-     })
+     return prisma.document.update({})
Tests ran:
    Documents Routes PATCH /documents/:id/status returns 200 with the updated status
    changeDocumentStatus transitions DRAFT to SENT
    changeDocumentStatus transitions SENT to ACCEPTED
  and 2 more tests!

[Survived] ObjectLiteral
src/modules/documents/documents.service.ts:153:11
-       data: { status: newStatus },
+       data: {},
Tests ran:
    Documents Routes PATCH /documents/:id/status returns 200 with the updated status
    changeDocumentStatus transitions DRAFT to SENT
    changeDocumentStatus transitions SENT to ACCEPTED
  and 2 more tests!

[NoCoverage] StringLiteral
src/modules/templates/templates.routes.ts:27:68
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0]?.message ?? "")

[NoCoverage] StringLiteral
src/modules/templates/templates.routes.ts:46:68
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0]?.message ?? "")

[Survived] LogicalOperator
src/modules/templates/templates.routes.ts:27:33
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0]?.message && 'Validation failed')
Tests ran:
    Templates Routes POST /templates returns 422 when name is missing
    Templates Routes POST /templates returns 422 when type is invalid
    Templates Routes POST /templates returns 422 when content is missing

[Survived] OptionalChaining
src/modules/templates/templates.routes.ts:27:33
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0].message ?? 'Validation failed')
Tests ran:
    Templates Routes POST /templates returns 422 when name is missing
    Templates Routes POST /templates returns 422 when type is invalid
    Templates Routes POST /templates returns 422 when content is missing

[Survived] LogicalOperator
src/modules/templates/templates.routes.ts:46:33
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0]?.message && 'Validation failed')
Tests ran:
    Templates Routes PATCH /templates/:id returns 422 when body is empty
    Templates Routes PATCH /templates/:id returns 422 when type is invalid

[Survived] OptionalChaining
src/modules/templates/templates.routes.ts:46:33
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0].message ?? 'Validation failed')
Tests ran:
    Templates Routes PATCH /templates/:id returns 422 when body is empty
    Templates Routes PATCH /templates/:id returns 422 when type is invalid

[NoCoverage] ObjectLiteral
src/modules/templates/templates.service.ts:55:36
-         ...(content !== undefined && { content: content as Prisma.InputJsonValue }),
+         ...(content !== undefined && {}),

[Survived] StringLiteral
src/modules/templates/templates.service.ts:12:42
-     if (!template) throw new NotFoundError('Template')
+     if (!template) throw new NotFoundError("")
Tests ran:
    Templates Routes GET /templates/:id returns 404 when template does not exist
    Templates Routes PATCH /templates/:id returns 404 when template does not exist
    Templates Routes DELETE /templates/:id returns 404 when template does not exist
  and 4 more tests!

[Survived] ConditionalExpression
src/modules/templates/templates.service.ts:55:11
-         ...(content !== undefined && { content: content as Prisma.InputJsonValue }),
+         ...(true),
Tests ran:
    Templates Routes PATCH /templates/:id returns 200 with the updated template
    updateTemplate updates and returns the template

[Survived] ConditionalExpression
src/modules/templates/templates.service.ts:55:11
-         ...(content !== undefined && { content: content as Prisma.InputJsonValue }),
+         ...(true && { content: content as Prisma.InputJsonValue }),
Tests ran:
    Templates Routes PATCH /templates/:id returns 200 with the updated template
    updateTemplate updates and returns the template

[Survived] ConditionalExpression
src/modules/templates/templates.service.ts:55:11
-         ...(content !== undefined && { content: content as Prisma.InputJsonValue }),
+         ...(false),
Tests ran:
    Templates Routes PATCH /templates/:id returns 200 with the updated template
    updateTemplate updates and returns the template

[Survived] LogicalOperator
src/modules/templates/templates.service.ts:55:11
-         ...(content !== undefined && { content: content as Prisma.InputJsonValue }),
+         ...(content !== undefined || {
+     content: content as Prisma.InputJsonValue
+   }),
Tests ran:
    Templates Routes PATCH /templates/:id returns 200 with the updated template
    updateTemplate updates and returns the template

[Survived] EqualityOperator
src/modules/templates/templates.service.ts:55:11
-         ...(content !== undefined && { content: content as Prisma.InputJsonValue }),
+         ...(content === undefined && { content: content as Prisma.InputJsonValue }),
Tests ran:
    Templates Routes PATCH /templates/:id returns 200 with the updated template
    updateTemplate updates and returns the template

[NoCoverage] StringLiteral
src/modules/users/users.routes.ts:21:68
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0]?.message ?? "")

[NoCoverage] StringLiteral
src/modules/users/users.routes.ts:32:68
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0]?.message ?? "")

[Survived] LogicalOperator
src/modules/users/users.routes.ts:21:33
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0]?.message && 'Validation failed')
Tests ran:
    Users Routes PATCH /users/me returns 422 for unknown fields in the payload
    Users Routes PATCH /users/me returns 422 when name is an empty string
    Users Routes PATCH /users/me returns 422 when no updatable fields are provided

[Survived] OptionalChaining
src/modules/users/users.routes.ts:21:33
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0].message ?? 'Validation failed')
Tests ran:
    Users Routes PATCH /users/me returns 422 for unknown fields in the payload
    Users Routes PATCH /users/me returns 422 when name is an empty string
    Users Routes PATCH /users/me returns 422 when no updatable fields are provided

[Survived] LogicalOperator
src/modules/users/users.routes.ts:32:33
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0]?.message && 'Validation failed')
Tests ran:
    Users Routes PATCH /users/me/password returns 422 for newPassword shorter than 8 characters
    Users Routes PATCH /users/me/password returns 422 when currentPassword is missing

[Survived] OptionalChaining
src/modules/users/users.routes.ts:32:33
-         throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+         throw new ValidationError(result.error.issues[0].message ?? 'Validation failed')
Tests ran:
    Users Routes PATCH /users/me/password returns 422 for newPassword shorter than 8 characters
    Users Routes PATCH /users/me/password returns 422 when currentPassword is missing

[Survived] ObjectLiteral
src/modules/users/users.service.ts:13:45
-     const user = await prisma.user.findUnique({ where: { id } })
+     const user = await prisma.user.findUnique({})
Tests ran:
    Users Routes GET /users/me returns 200 with the authenticated user profile
    Users Routes GET /users/me never exposes passwordHash in the response
    Users Routes GET /users/me returns 404 when authenticated user has been deleted
  and 3 more tests!

[Survived] ObjectLiteral
src/modules/users/users.service.ts:13:54
-     const user = await prisma.user.findUnique({ where: { id } })
+     const user = await prisma.user.findUnique({ where: {} })
Tests ran:
    Users Routes GET /users/me returns 200 with the authenticated user profile
    Users Routes GET /users/me never exposes passwordHash in the response
    Users Routes GET /users/me returns 404 when authenticated user has been deleted
  and 3 more tests!

[Survived] StringLiteral
src/modules/users/users.service.ts:50:42
-     if (!user) throw new UnauthorizedError('Invalid credentials')
+     if (!user) throw new UnauthorizedError("")
Tests ran:
    changePassword throws UnauthorizedError when user not found

[Survived] StringLiteral
src/modules/users/users.service.ts:14:65
-     if (!user || user.deletedAt !== null) throw new NotFoundError('User')
+     if (!user || user.deletedAt !== null) throw new NotFoundError("")
Tests ran:
    Users Routes GET /users/me returns 404 when authenticated user has been deleted
    getProfile throws NotFoundError when user does not exist
    getProfile throws NotFoundError for soft-deleted users
