[NoCoverage] StringLiteral
src/modules/auth/auth.routes.ts:19:35
-     env.NODE_ENV === 'production' ? '__Secure-refresh_token' : 'refresh_token'
+     env.NODE_ENV === 'production' ? "" : 'refresh_token'

[NoCoverage] StringLiteral
src/modules/auth/auth.routes.ts:51:70
-           throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+           throw new ValidationError(result.error.issues[0]?.message ?? "")

[NoCoverage] StringLiteral
src/modules/auth/auth.routes.ts:78:70
-           throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+           throw new ValidationError(result.error.issues[0]?.message ?? "")

[Survived] LogicalOperator
src/modules/auth/auth.routes.ts:51:35
-           throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+           throw new ValidationError(result.error.issues[0]?.message && 'Validation failed')
Tests ran:
    Auth Routes POST /auth/register returns 422 for invalid email format
    Auth Routes POST /auth/register returns 422 for password shorter than 8 characters
    Auth Routes POST /auth/register returns 422 when name is missing

[Survived] ObjectLiteral
src/modules/auth/auth.routes.ts:36:5
-       { sub: userId, jti: randomUUID() },
+       {},
Tests ran:
    Auth Routes POST /auth/register returns 201 with accessToken and user payload on success
    Auth Routes POST /auth/register sets httpOnly refresh_token cookie on success
    Auth Routes POST /auth/register access token contains correct sub, email, and role claims
  and 5 more tests!

[Survived] OptionalChaining
src/modules/auth/auth.routes.ts:51:35
-           throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+           throw new ValidationError(result.error.issues[0].message ?? 'Validation failed')
Tests ran:
    Auth Routes POST /auth/register returns 422 for invalid email format
    Auth Routes POST /auth/register returns 422 for password shorter than 8 characters
    Auth Routes POST /auth/register returns 422 when name is missing

[Survived] ObjectLiteral
src/modules/auth/auth.routes.ts:40:5
-       { expiresIn: env.JWT_REFRESH_EXPIRY as jwt.SignOptions['expiresIn'] },
+       {},
Tests ran:
    Auth Routes POST /auth/register returns 201 with accessToken and user payload on success
    Auth Routes POST /auth/register sets httpOnly refresh_token cookie on success
    Auth Routes POST /auth/register access token contains correct sub, email, and role claims
  and 5 more tests!

[Survived] BlockStatement
src/modules/auth/auth.routes.ts:34:51
-   function signRefreshToken(userId: string): string {
-     return jwt.sign(
-       { sub: userId, jti: randomUUID() },
-       env.JWT_REFRESH_SECRET,
-       // Cast to SignOptions['expiresIn']: our Zod schema validates the duration
-       // format, but TypeScript can't narrow `string` to ms.StringValue at compile time.
-       { expiresIn: env.JWT_REFRESH_EXPIRY as jwt.SignOptions['expiresIn'] },
-     )
-   }
+   function signRefreshToken(userId: string): string {}
Tests ran:
    Auth Routes POST /auth/register returns 201 with accessToken and user payload on success
    Auth Routes POST /auth/register sets httpOnly refresh_token cookie on success
    Auth Routes POST /auth/register access token contains correct sub, email, and role claims
  and 5 more tests!

[Survived] LogicalOperator
src/modules/auth/auth.routes.ts:78:35
-           throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+           throw new ValidationError(result.error.issues[0]?.message && 'Validation failed')
Tests ran:
    Auth Routes POST /auth/login returns 422 for missing email field

[Survived] OptionalChaining
src/modules/auth/auth.routes.ts:78:35
-           throw new ValidationError(result.error.issues[0]?.message ?? 'Validation failed')
+           throw new ValidationError(result.error.issues[0].message ?? 'Validation failed')
Tests ran:
    Auth Routes POST /auth/login returns 422 for missing email field

[Survived] ObjectLiteral
src/modules/auth/auth.routes.ts:83:40
-         const accessToken = app.jwt.sign({
-           sub: user.id,
-           email: user.email,
-           role: 'authenticated' as const,
-         })
+         const accessToken = app.jwt.sign({})
Tests ran:
    Auth Routes POST /auth/login returns 200 with accessToken on valid credentials
    Auth Routes POST /auth/login sets httpOnly refresh_token cookie on login

[Survived] ObjectLiteral
src/modules/auth/auth.routes.ts:94:15
-           user: { id: user.id, email: user.email, name: user.name },
+           user: {},
Tests ran:
    Auth Routes POST /auth/login returns 200 with accessToken on valid credentials
    Auth Routes POST /auth/login sets httpOnly refresh_token cookie on login

[Survived] ObjectLiteral
src/modules/auth/auth.routes.ts:104:46
-         reply.clearCookie(REFRESH_COOKIE_NAME, { path: '/' })
+         reply.clearCookie(REFRESH_COOKIE_NAME, {})
Tests ran:
    Auth Routes POST /auth/logout returns 200 and clears the refresh cookie when authenticated

[Survived] StringLiteral
src/modules/auth/auth.routes.ts:104:54
-         reply.clearCookie(REFRESH_COOKIE_NAME, { path: '/' })
+         reply.clearCookie(REFRESH_COOKIE_NAME, { path: "" })
Tests ran:
    Auth Routes POST /auth/logout returns 200 and clears the refresh cookie when authenticated

[Survived] ObjectLiteral
src/modules/auth/auth.routes.ts:129:40
-         const accessToken = app.jwt.sign({
-           sub: user.id,
-           email: user.email,
-           role: 'authenticated' as const,
-         })
+         const accessToken = app.jwt.sign({})
Tests ran:
    Auth Routes POST /auth/refresh returns 200 with new accessToken for a valid refresh cookie
    Auth Routes POST /auth/refresh rotates the refresh token (new cookie differs from old)

[Survived] ObjectLiteral
src/modules/auth/auth.service.ts:29:49
-     const existing = await prisma.user.findUnique({
-       where: { email: data.email },
-     })
+     const existing = await prisma.user.findUnique({})
Tests ran:
    Auth Routes POST /auth/register returns 201 with accessToken and user payload on success
    Auth Routes POST /auth/register sets httpOnly refresh_token cookie on success
    Auth Routes POST /auth/register access token contains correct sub, email, and role claims
  and 6 more tests!

[Survived] ObjectLiteral
src/modules/auth/auth.service.ts:30:12
-       where: { email: data.email },
+       where: {},
Tests ran:
    Auth Routes POST /auth/register returns 201 with accessToken and user payload on success
    Auth Routes POST /auth/register sets httpOnly refresh_token cookie on success
    Auth Routes POST /auth/register access token contains correct sub, email, and role claims
  and 6 more tests!

[Survived] ObjectLiteral
src/modules/auth/auth.service.ts:46:45
-     const user = await prisma.user.findUnique({
-       where: { email: data.email },
-     })
+     const user = await prisma.user.findUnique({})
Tests ran:
    Auth Routes POST /auth/login returns 200 with accessToken on valid credentials
    Auth Routes POST /auth/login sets httpOnly refresh_token cookie on login
    Auth Routes POST /auth/login returns 401 for wrong password
  and 8 more tests!

[Survived] ObjectLiteral
src/modules/auth/auth.service.ts:47:12
-       where: { email: data.email },
+       where: {},
Tests ran:
    Auth Routes POST /auth/login returns 200 with accessToken on valid credentials
    Auth Routes POST /auth/login sets httpOnly refresh_token cookie on login
    Auth Routes POST /auth/login returns 401 for wrong password
  and 8 more tests!

[Survived] ArrowFunction
src/modules/auth/auth.service.ts:54:73
-     const valid = await verifyPassword(hashToVerify, data.password).catch(() => false)
+     const valid = await verifyPassword(hashToVerify, data.password).catch(() => undefined)
Tests ran:
    Auth Routes POST /auth/login returns 200 with accessToken on valid credentials
    Auth Routes POST /auth/login sets httpOnly refresh_token cookie on login
    Auth Routes POST /auth/login returns 401 for wrong password
  and 8 more tests!

[Survived] ConditionalExpression
src/modules/auth/auth.service.ts:57:7
-     if (!user || user.deletedAt !== null || !valid) {
+     if (false || !valid) {
Tests ran:
    Auth Routes POST /auth/login returns 200 with accessToken on valid credentials
    Auth Routes POST /auth/login sets httpOnly refresh_token cookie on login
    Auth Routes POST /auth/login returns 401 for wrong password
  and 8 more tests!

[Survived] ConditionalExpression
src/modules/auth/auth.service.ts:57:16
-     if (!user || user.deletedAt !== null || !valid) {
+     if (!user || false || !valid) {
Tests ran:
    Auth Routes POST /auth/login returns 200 with accessToken on valid credentials
    Auth Routes POST /auth/login sets httpOnly refresh_token cookie on login
    Auth Routes POST /auth/login returns 401 for wrong password
  and 6 more tests!

[Survived] ObjectLiteral
src/modules/auth/auth.service.ts:68:45
-     const user = await prisma.user.findUnique({ where: { id } })
+     const user = await prisma.user.findUnique({})
Tests ran:
    Auth Routes POST /auth/refresh returns 200 with new accessToken for a valid refresh cookie
    Auth Routes POST /auth/refresh rotates the refresh token (new cookie differs from old)
    Auth Routes POST /auth/refresh returns 401 when the user no longer exists in the database
  and 3 more tests!

[Survived] ObjectLiteral
src/modules/auth/auth.service.ts:68:54
-     const user = await prisma.user.findUnique({ where: { id } })
+     const user = await prisma.user.findUnique({ where: {} })
Tests ran:
    Auth Routes POST /auth/refresh returns 200 with new accessToken for a valid refresh cookie
    Auth Routes POST /auth/refresh rotates the refresh token (new cookie differs from old)
    Auth Routes POST /auth/refresh returns 401 when the user no longer exists in the database
  and 3 more tests!

[Survived] StringLiteral
src/modules/users/users.service.ts:56:31
-       throw new ValidationError('New password must differ from the current password')
+       throw new ValidationError("")
Tests ran:
    Users Routes PATCH /users/me/password returns 422 when newPassword is the same as currentPassword
    changePassword throws ValidationError when new password equals current password

[Survived] ObjectLiteral
src/shared/middlewares/authenticate.ts:25:7
-         { url: request.url, method: request.method },
+         {},
Tests ran:
    Documents Routes GET /documents returns 401 without authentication
    Documents Routes POST /documents returns 401 without authentication
    Documents Routes GET /documents/:id returns 401 without authentication
  and 17 more tests!

[Survived] StringLiteral
src/shared/middlewares/authenticate.ts:26:7
-         'Access denied — invalid or missing token',
+         "",
Tests ran:
    Documents Routes GET /documents returns 401 without authentication
    Documents Routes POST /documents returns 401 without authentication
    Documents Routes GET /documents/:id returns 401 without authentication
  and 17 more tests!
