[Survived] ObjectLiteral
src/modules/users/users.service.ts:49:54
-     const user = await prisma.user.findUnique({ where: { id: userId } })
+     const user = await prisma.user.findUnique({ where: {} })
Tests ran:
    Users Routes PATCH /users/me/password returns 200 on successful password change
    Users Routes PATCH /users/me/password returns 401 when currentPassword is incorrect
    Users Routes PATCH /users/me/password returns 422 when newPassword is the same as currentPassword
  and 5 more tests!

[Survived] ObjectLiteral
src/modules/users/users.service.ts:49:45
-     const user = await prisma.user.findUnique({ where: { id: userId } })
+     const user = await prisma.user.findUnique({})
Tests ran:
    Users Routes PATCH /users/me/password returns 200 on successful password change
    Users Routes PATCH /users/me/password returns 401 when currentPassword is incorrect
    Users Routes PATCH /users/me/password returns 422 when newPassword is the same as currentPassword
  and 5 more tests!

[Survived] StringLiteral
src/modules/users/users.service.ts:53:43
-     if (!valid) throw new UnauthorizedError('Invalid credentials')
+     if (!valid) throw new UnauthorizedError("")
Tests ran:
    Users Routes PATCH /users/me/password returns 401 when currentPassword is incorrect
    changePassword throws UnauthorizedError when currentPassword is wrong
    changePassword never updates the record if currentPassword verification fails

[Survived] ObjectLiteral
src/modules/users/users.service.ts:61:12
-       where: { id: userId },
+       where: {},
Tests ran:
    Users Routes PATCH /users/me/password returns 200 on successful password change
    changePassword hashes the new password and updates the record

[Survived] StringLiteral
src/shared/errors/AppError.ts:39:25
-     constructor(message = 'Forbidden') {
+     constructor(message = "") {
Tests ran:
    ForbiddenError returns 403

[Survived] StringLiteral
src/shared/errors/AppError.ts:46:25
-     constructor(message = 'Conflict') {
+     constructor(message = "") {
Tests ran:
    ConflictError returns 409

[Survived] StringLiteral
src/shared/errors/AppError.ts:53:25
-     constructor(message = 'Validation error') {
+     constructor(message = "") {
Tests ran:
    ValidationError returns 422

[Survived] StringLiteral
src/shared/errors/AppError.ts:60:25
-     constructor(message = 'Unprocessable entity') {
+     constructor(message = "") {
Tests ran:
    UnprocessableEntityError returns 422

[Survived] StringLiteral
src/shared/errors/AppError.ts:62:17
-       this.name = 'UnprocessableEntityError'
+       this.name = ""
Tests ran:
    UnprocessableEntityError returns 422
